app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (name Like '%%')
---
  def index
    @books = Book.where(["name Like ?","%#{params[:search]}%"])

INSERT INTO "books" ("name", "category", "price", "isbn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "math"], ["category", "math"], ["price", 2999.0], ["isbn", 2], ["created_at", "2022-02-16 11:25:15.835566"], ["updated_at", "2022-02-16 11:25:15.835566"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "price" = ?, "isbn" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["price", 29.0], ["isbn", 3], ["updated_at", "2022-02-16 11:25:28.889329"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)